БухЭксп/InformationRegisters/CW_ДатыАктуальностиФильтровСистемныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДатыАктуальностиФильтровСистемныхСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Фильтр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ФильтрыСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПриоритетыСистемныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПриоритетыСистемныхСообщений</Name>
			<Comment>Приоритеты по RFC 5424</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>p0</Name>
					<Comment>Emergency (panic)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p1</Name>
					<Comment>Alert (alert)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p2</Name>
					<Comment>Critical (crit)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p3</Name>
					<Comment>Error (error)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p4</Name>
					<Comment>Warning (warning)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p5</Name>
					<Comment>Notice (notice)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p6</Name>
					<Comment>Informational (info)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p7</Name>
					<Comment>Debug (debug)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СобытияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СобытияОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПометкаУдаления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеПометкиУдаления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_СистемныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СистемныеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИсточникиСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПриоритетыСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСсылок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеСообщения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ИсторияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ИсторияОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СобытияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_Журнал/Ext/Module.bsl
Функция ЗаписатьСообщение(Источник,Приоритет,Сообщение,Ссылки=Неопределено,Данные=Неопределено) Экспорт 
	// --- 
	
	Попытка
		
		НовоеСообщение = Справочники.CW_СистемныеСообщения.СоздатьЭлемент();
		НовоеСообщение.Дата = ТекущаяДата();
		НовоеСообщение.Источник = CW_Журнал_ПИ.ИсточникСообщения(Источник);
		НовоеСообщение.Приоритет = CW_Журнал_ПИ.ПриоритетСообщения(Приоритет);
		НовоеСообщение.Сообщение = Сообщение;
		
		// --- 
		
		Если Ссылки <> Неопределено Тогда
			
			Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
				
				Для каждого Ссылка Из Ссылки Цикл
					
					Нстр = НовоеСообщение.СписокСсылок.Добавить();
					Нстр.СсылкаСообщения = ПолучитьНавигационнуюСсылку(Ссылка);
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		// --- 
		
		НовоеСообщение.Записать();
		
		Возврат(НовоеСообщение.Ссылка);
		
		// --- 
		
		// если файловая база
		// отправляем письмо
		
		Если НЕ _сф.СервернаяБаза() Тогда
			
			//УчетнаяЗаписьСистемныхСообщений = Константы.УчетнаяЗаписьДляСистемныхСообщений.Получить();
			//ПолучателиСистемныхСообщений = Константы.ЭлектронныеАдресаПолучателейСистемныхСообщений.Получить();
			//
			//Если (НЕ УчетнаяЗаписьСистемныхСообщений.Пустая()) И (НЕ СокрЛП(ПолучателиСистемныхСообщений)="") Тогда
			//	
			//	// --- 
			//	
			//	// формируем письмо
			//	
			//	СтруктураПисьма = _ЭП.СтруктураПисьма();
			//	СтруктураПисьма.Отправитель = УчетнаяЗаписьСистемныхСообщений.Наименование;
			//	СтруктураПисьма.Получатели = _сф.сп_СоздатьИзСтроки(СтрЗаменить(ПолучателиСистемныхСообщений,",",";"),";");
			//	// --- 
			//	СтруктураПисьма.Тема = "[БАЛ] "+НовоеСообщение.Источник;
			//	СтруктураПисьма.Тело = "Системное сообщение: "+ПолучитьНавигационнуюСсылку(НовоеСообщение.Ссылка)+Символы.ПС+НовоеСообщение.Сообщение;
			//	
			//	Ответ = _ЭП.ОтправитьПисьмо(СтруктураПисьма,УчетнаяЗаписьСистемныхСообщений);
			//	Если Ответ.Код <> 0 Тогда
			//		
			//		ЗаписьЖурналаРегистрации("ИБ.СистемноеСообщение",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки()+"; Сообщение:"+Сообщение);
			//		
			//	КонецЕсли; 
			//	
			//	// --- 
			//	
			//КонецЕсли; 
			//
		КонецЕсли; 
		
	Исключение
	    
		ЗаписьЖурналаРегистрации("ИБ.СистемноеСообщение",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки()+"; Сообщение:"+Сообщение);
		Возврат(Неопределено);
		
	КонецПопытки; 
	
	// --- 
КонецФункции

Процедура ОтладочноеСообщение(Источник,Сообщение,Ссылки=Неопределено,Данные=Неопределено) Экспорт 
	// --- 
	
	ЗаписатьСообщение(Источник,Перечисления.CW_ПриоритетыСистемныхСообщений.p7,Сообщение,Ссылки,Данные);
	
	// --- 
КонецПроцедуры

Процедура CW_РегламентнаяОтправкаСистемныхСообщений(Фильтр) Экспорт
	
	// получаем неотправленные 
	МассивСообщений = ПолучитьСообщения(Фильтр);
	
	Если МассивСообщений.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	// формируем структу письма
	СП = _ЭП.СтруктураПисьма();
	СП.Отправитель = Фильтр.УчетнаяЗапись;
	// --- 
	_ЭП.ЗаполнитьПолучателейПоТаблице(СП,Фильтр.Получатели);
	// --- 
	СП.Тема = Фильтр.ТемаСообщения;
	// --- 
	_ЭП.ДобавитьТекст(СП,СформироватьТекстПисьма(МассивСообщений));

	// оправляем или помещаем в очередь на отправку
	Ответ = _ЭП.ОтправитьПисьмо(СП);
	// если успешно - меняем дату актуальности фильтра
	Если Ответ.Код = 0 Тогда
		
		УстановитьДатуАктуальностиФильтра(Фильтр,_сф.к_ПоследнийЭлемент(МассивСообщений).Дата);
		
	КонецЕсли; 
	
КонецПроцедуры
  
Функция ПолучитьСообщения(Фильтр)
	// --- 
	
	// определяем дату последней отправки сообщений
	ДатаПоследнейОтправки = ПолучитьДатуАктуальностиФильтра(Фильтр);
	// получаем сообщения старше даты актуальности
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СистемныеСообщения.Ссылка
	               |ИЗ
	               |	Справочник.CW_СистемныеСообщения КАК CW_СистемныеСообщения
	               |ГДЕ
	               |	CW_СистемныеСообщения.Дата > &ДатаПоследнейОтправки
	               |	И CW_СистемныеСообщения.ПометкаУдаления = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоПриоритету = ЛОЖЬ
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_СистемныеСообщения.Приоритет В (&СписокПриоритетов)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ТолькоЗаданныеИсточники = ЛОЖЬ
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_СистемныеСообщения.Источник В (&СписокИсточников)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &КромеИсточников = ЛОЖЬ
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ CW_СистемныеСообщения.Источник В (&СписокИсточников)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ДатаПоследнейОтправки", ДатаПоследнейОтправки);
	// --- 
	ОтборПоПриоритету = Фильтр.ОтборПоПриоритету;
	Запрос.УстановитьПараметр("ОтборПоПриоритету",ОтборПоПриоритету);
	Если ОтборПоПриоритету Тогда
		
		// сформируем массив приоритетов
		МассивПриоритетов = _сф.м_СоздатьИзКолонкиТЗ(Фильтр.Приоритеты.Выгрузить(),"Приоритет");
		Запрос.УстановитьПараметр("СписокПриоритетов", МассивПриоритетов); 
		
	Иначе
		
		Запрос.УстановитьПараметр("СписокПриоритетов", Неопределено);
		
	КонецЕсли; 
	// --- 
	Если Фильтр.ВариантФильтрацииПоИсточнику <> 0 Тогда
		
		// формируем массив источников
		МассивИсточников = _сф.м_СоздатьИзКолонкиТЗ(Фильтр.Источники.Выгрузить(),"Источник");
		Запрос.УстановитьПараметр("СписокИсточников", МассивИсточников);
		
		Если Фильтр.ВариантФильтрацииПоИсточнику = 1 Тогда
			
			Запрос.УстановитьПараметр("ТолькоЗаданныеИсточники", Истина); 
			Запрос.УстановитьПараметр("КромеИсточников", Ложь); 
			
		Иначе
			
			Запрос.УстановитьПараметр("ТолькоЗаданныеИсточники", Ложь); 
			Запрос.УстановитьПараметр("КромеИсточников", Истина); 
			
		КонецЕсли;
		
	Иначе
		
		Запрос.УстановитьПараметр("ТолькоЗаданныеИсточники", Ложь); 
		Запрос.УстановитьПараметр("КромеИсточников", Ложь);
		Запрос.УстановитьПараметр("СписокИсточников", Неопределено);
		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	МассивСообщений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// --- 
	
	Возврат(МассивСообщений);
	
	// --- 
КонецФункции

Функция СформироватьТекстПисьма(МассивСообщений) Экспорт 
	// --- 
	
	Текст = "";
	Для каждого Сообщение Из МассивСообщений Цикл
		
		_сф.стр_Добавить(Текст,"Дата     : "+Формат(Сообщение.Дата,"ДФ='yyyy.MM.dd HH:mm:ss'")+Символы.ПС);
		_сф.стр_Добавить(Текст,"Источник : "+Строка(Сообщение.Источник)+Символы.ПС);
		_сф.стр_Добавить(Текст,"Приоритет: "+Строка(Сообщение.Приоритет)+Символы.ПС);
		_сф.стр_Добавить(Текст,Сообщение.Сообщение+Символы.ПС);
		_сф.стр_Добавить(Текст,"---"+Символы.ПС);
		
	КонецЦикла; 
	
	Возврат(Текст);
	
	// --- 
КонецФункции

Функция ПолучитьДатуАктуальностиФильтра(Фильтр)
	// --- 
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	CW_ДатыАктуальностиФильтровСистемныхСообщений.Дата
	|ИЗ
	|	РегистрСведений.CW_ДатыАктуальностиФильтровСистемныхСообщений КАК CW_ДатыАктуальностиФильтровСистемныхСообщений
	|ГДЕ
	|	CW_ДатыАктуальностиФильтровСистемныхСообщений.Фильтр = &Фильтр";
	ДатаАктуальности = _сф.ВыполнитьЗапрос(ТекстЗапроса, Новый Структура("Фильтр", Фильтр),Истина,"Дата",Дата(1,1,1));
	Возврат(ДатаАктуальности);
	
	// --- 
КонецФункции

Функция УстановитьДатуАктуальностиФильтра(Фильтр,Дата)
	// --- 
	
	НЗ = РегистрыСведений.CW_ДатыАктуальностиФильтровСистемныхСообщений.СоздатьНаборЗаписей();
	_сф.УстановитьОтбор(НЗ.Отбор,"Фильтр",Фильтр);
	Запись = НЗ.Добавить();
	Запись.Фильтр = Фильтр;
	Запись.Дата = Дата;
	НЗ.Записать(Истина);
	
	// --- 
КонецФункции


// ИСТОРИЯ ОБЪЕКТОВ

Процедура ОпределитьРежимЗаписиОбъекта(Источник, РежимЗаписи=Неопределено) Экспорт 
	
	Метаданное = CW_Обмены_ПИ.МетаданноеКонфигурации(Источник.Метаданные().ПолноеИмя());
	Если Не CW_Журнал_ПИ.ТребуетсяИсторияДляОбъектаМетаданных(Метаданное) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("CW_СобытиеЗаписи") Тогда 
		Источник.ДополнительныеСвойства.Вставить("_СобытиеЗаписи", Источник.ДополнительныеСвойства.CW_СобытиеЗаписи);
		Возврат;
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	// проверить, что эта часть уже не понадобится
	
	Если РежимЗаписи = Неопределено Тогда
		
		Вид = "Справочник";
		
	Иначе
		
		Вид = "Документ";
		
	КонецЕсли; 
	
	Если Вид = "Справочник" Тогда
		
		Событие = Перечисления.CW_СобытияОбъектов.ПустаяСсылка();
		// --- 
		Если Источник.Ссылка.Пустая() Тогда
			Событие = Перечисления.CW_СобытияОбъектов.Создание;
		Иначе
			Если Источник.ПометкаУдаления <> Источник.Ссылка.ПометкаУдаления Тогда
				Если Источник.ПометкаУдаления Тогда
					Событие = Перечисления.CW_СобытияОбъектов.ПометкаУдаления;
				Иначе
					Событие = Перечисления.CW_СобытияОбъектов.СнятиеПометкиУдаления;
				КонецЕсли; 
			Иначе
				Событие = Перечисления.CW_СобытияОбъектов.Изменение;			
			КонецЕсли;
		КонецЕсли;
		// --- 
		_сф.ст_УстановитьСвойство(Источник.ДополнительныеСвойства,"_СобытиеЗаписи",Событие);
		
	ИначеЕсли Вид = "Документ" Тогда 
		
		Событие = Перечисления.CW_СобытияОбъектов.ПустаяСсылка();
		// --- 
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Событие = Перечисления.CW_СобытияОбъектов.Проведение;
			
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			
			 Событие = Перечисления.CW_СобытияОбъектов.ОтменаПроведения;
			 
		 ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
			 
			 Если Источник.Ссылка.Пустая() Тогда
				 Событие = Перечисления.CW_СобытияОбъектов.Создание;
			 Иначе
				 Если Источник.ПометкаУдаления <> Источник.Ссылка.ПометкаУдаления Тогда
					 Если Источник.ПометкаУдаления Тогда
						 Событие = Перечисления.CW_СобытияОбъектов.ПометкаУдаления;
					 Иначе
						 Событие = Перечисления.CW_СобытияОбъектов.СнятиеПометкиУдаления;
					 КонецЕсли; 
				 Иначе
					 Событие = Перечисления.CW_СобытияОбъектов.Изменение;			
				 КонецЕсли;
			 КонецЕсли;
			 
		КонецЕсли; 
		// --- 
		_сф.ст_УстановитьСвойство(Источник.ДополнительныеСвойства,"_СобытиеЗаписи",Событие);
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

Процедура ДобавитьЗаписьИстории(Источник,Событие,Пользователь = Неопределено,Дата=Неопределено) Экспорт 
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = CW_Настройки.Пользователь();
		
	КонецЕсли; 
	
	Если Дата = Неопределено Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли; 
	
	ЭлементИстории = Справочники.CW_ИсторияОбъектов.СоздатьЭлемент();
	ЭлементИстории.Дата = Дата;
	ЭлементИстории.Объект = Источник.Ссылка.УникальныйИдентификатор();
	ЭлементИстории.CW_Представление = Строка(Источник.Ссылка);
	ЭлементИстории.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Источник.Ссылка);
	ЭлементИстории.Пользователь = Пользователь;
	ЭлементИстории.Событие = Событие;
	ЭлементИстории.ИмяКомпьютера = ИмяКомпьютера();
	ЭлементИстории.ОбменДанными.Загрузка=Истина;
	ЭлементИстории.Записать();
	
КонецПроцедуры
